# to install use "brew bundle install --verbose"

###########
# GENERAL #
###########

cask "element"
cask "signal"
cask "discord"
cask "microsoft-teams"
# cask "arc"
cask "firefox"

mas "Dashlane", id: 517914548
# mas "Endel", id: 1346247457
mas "Reeder", id: 1529448980
mas "WhatsApp", id: 310633997

# Safari Extensions
# mas "DuckDuckGo Privacy for Safari", id: 1482920575    # discontinued in Safari for some reason
# mas "Dynamo", id: 1445910651
mas "Noir", id: 1592917505
# mas "Notion Web Clipper", id: 1559269364
mas "Obsidian Web Clipper", id: 6720708363
# mas "PiPifier", id: 1160374471


#############
# WORKSPACE #
#############

brew "FelixKratz/formulae/sketchybar"

cask "nikitabobko/tap/aerospace"
# cask "alt-tab"
cask "jordanbaird-ice"
cask "raycast"

# mas "Magnet", id: 441258766


#############
# UTILITIES #
#############

# brew "htop"
brew "pandoc"              # universal markup format converter
brew "quaggaone/tap/panfd" # pandoc wrapper script for custom templates

cask "karabiner-elements"
cask "mac-mouse-fix"
# cask "macs-fan-control"
# cask "monitorcontrol"

cask "claude"
cask "claude-code"
cask "cleanmymac"
cask "synology-drive"
cask "cyberduck"
cask "iina"
cask "yubico-authenticator"
# cask "yubico-yubikey-manager"
cask "utm"
cask "imageoptim"
cask "obs"
cask "ollama-app"

mas "AudioSwitcher", id: 561712678
mas "AusweisApp", id: 948660805
mas "Boop", id: 1518425043
mas "DaisyDisk", id: 411643860
mas "Hotspot Shield", id: 771076721
mas "Mountain Duck", id: 1024974133
mas "The Unarchiver", id: 425424353
mas "Usage", id: 1561788435
mas "WireGuard", id: 1451685025
mas "HomeControl", id: 1547121417
mas "Scenecuts", id: 1540491573


#######
# DEV #
#######

brew "composer"     # php dependency manager
brew "eza"          # replacement for ls
brew "fzf"          # fuzzy finder
brew "git-delta"    # syntax-highlighting pager for git, diff, and grep
brew "node"         # maybe replace with nvm to manage node installs
brew "python"       # installs latest python because macOS doesn't
# brew "ruby"         # more modern version than macOS provides
brew "solargraph"   # install ruby lsp (bypasses dependency requirements due to old system ruby)
brew "starship"     # cross-shell prompt
brew "uv"           # faster pyhton pip replacement
brew "zoxide"       # cd replacement

cask "ghostty"
# cask "mactex"       # full tex distro; installs latex and pdflatex
cask "mamp"
cask "quarto"       # replaces R knitr pipeline; more modern, more output types
cask "vscodium"
cask "xcodes-app"
cask "zed"

# mas "Xcode", id: 497799835
mas "Playgrounds", id: 1496833156
mas "Developer", id: 640199958


##########
# OFFICE #
##########

brew "typst"        # markup-based typesetting system

cask "markedit"
cask "notion"
cask "obsidian"

mas "Goodnotes", id: 1444383602
# mas "Ulysses", id: 1225570693

mas "Numbers", id: 409203825
mas "Keynote", id: 409183694
mas "Pages", id: 409201541

mas "Microsoft Excel", id: 462058435
mas "Microsoft PowerPoint", id: 462062816
mas "Microsoft Word", id: 462054704
# mas "Microsoft OneNote", id: 784801555
mas "Microsoft Outlook", id: 985367838


###############
# PHOTO VIDEO #
###############

cask "adobe-creative-cloud"

mas "Affinity Designer 2", id: 1616831348
mas "Affinity Photo 2", id: 1616822987
mas "Affinity Publisher 2", id: 1606941598
# mas "Affinity Designer", id: 824171161
# mas "Affinity Photo", id: 824183456
# mas "Affinity Publisher", id: 881418622

mas "Pixelmator Pro", id: 1289583905
mas "Photomator", id: 1444636541

mas "iMovie", id: 408981434
mas "Final Cut Pro", id: 424389933
mas "Motion", id: 434290957
mas "Compressor", id: 424390742

mas "GarageBand", id: 682658836
mas "Logic Pro", id: 634148309
# mas "MainStage", id: 634159523


#######
# UNI #
#######

brew "r"    # explicitly install as formula (no GUI r console)

cask "anki"
# cask "rstudio"


#########
# FONTS #
#########

cask "font-sf-pro"
cask "sf-symbols"
cask "font-ibm-plex-sans"
cask "font-ibm-plex-sans-condensed"
cask "font-ibm-plex-serif"
cask "font-ibm-plex-mono"
cask "font-ibm-plex-math"
cask "font-blex-mono-nerd-font"		# Nerd Font of IBM Plex Mono
# cask "font-iosevka-term-nerd-font"
# cask "font-iosevka-nerd-font"
cask "font-zed-mono-nerd-font"

cask "font-sketchybar-app-font"   # menubar font for app icons

#####################
# VSCODE EXTENSIONS #
#####################

vscode "mvllow.rose-pine"           # color theme
vscode "REditorSupport.r"           # R lang support
vscode "myriad-dreamin.tinymist"    # integrated typst language service
vscode "quarto.quarto"              # open-source scientific and technical publishing system
vscode "anthropic.claude-code"      # claude code with gui
vscode "openai.chatgpt"             # codex with gui

